package lesson8;

public class Main {
    public static void main(String[] args) {
//        System.out.println("Hello world"); //String
//        System.out.println(1111); //int
//        System.out.println(232.23244);// double

//        String name = "Andrii";
//        name =   " Cool guy "  + name;
//        name = " best father " + name;
//
//        System.out.println(name);

//        String name = "Спукаючись вниз по драбині, можна впасти вверх";
//
//        System.out.println(name.replace("драбині", "хуїні"));

        String textKravshik = "Утвердження власної державності з усіма її атрибутами — одне з найголовніших завдань, без розв’язання якого народ України ніколи не буде вільним і не зможе сам вирішувати свою долю. Нова держава має бути суверенною і самоврядною, незалежною, правовою і відкритою, здатною надійно захистити життя, майно, всі законні інтереси громадян.\n" +
                "\n" +
                "Демократія. Українська держава не може бути нічим іншим, як демократичною державою. Не люди для держави, а держава для людей. Ми маємо прийти до суспільства, де правлять не правителі, а закони, де верховенство не «вищих розпоряджень», а прав і свобод людини. Треба створити всі умови для формування справжнього громадянина своєї держави — вільного, заможного, культурного.\n" +
                "\n" +
                "Достаток. Людині, сім’ї, всьому народу нашому необхідно нарешті забезпечити достаток. Ми повинні створити соціально спрямовану економіку, яка працює на людину, а не за рахунок людини, дає людині все для нормального цивілізованого життя: продовольство, одяг, житло,транспортні засоби, товари широкого вжитку і т. д. Треба передати власність людині, зробити її господарем своєї праці та результатів цієї праці. Виробникам — повний простір для ініціативи, непрацездатним та малозабезпеченим — соціальний захист та допомога з боку держави.\n" +
                "\n" +
                "Духовність. Історично склалося так, що душу українців, їхню національну самосвідомість, їхню мову, культуру, звичаї нищили протягом століть. Наш святий обов’язок — забезпечити, у найширшому розумінні слова, духовне відродження української нації, надійно гарантуючи водночас вільний національно-культурний розвиток представникам усіх національностей, що утворюють український народ. Особа, сім’я, духовність — альфа і омега державної політики. Пріоритети у ній — розвитку освіти, науки, культури.\n" +
                "\n" +
                "Довір’я. Всі ми разом повинні постійно піклуватися про встановлення у нашому українському домі атмосфери довір’я. Довір’я народу до влади, влади — до народу, людини — до людини. Підозрілість, відчуженість, нетерпимість як саркома роз’їдають суспільний організм. Тому — злагода і ще раз злагода. Тільки за цієї умови ми зможемо побудувати нову, вільну, незалежну, суверенну Україну — державу народу і для народу, для його блага, процвітання, щастя.";


        textKravshik = textKravshik.replace("громадянин", "дробадянин");
//        System.out.println(textKravshik);

        String myText = "Руда скотиняка вронила пляшку зі столу";
        System.out.println(myText.toLowerCase().contains("руда"));

        String text = "Литвинов              Віталій                      Олексійович";

//        String[] words = text.split("[\\s]+");
//        String abr = "";
//
//        for (int i = 0; i < words.length; i++) {
//            abr += words[i].substring(0, 1).toUpperCase() + ".";
//        }
//
//        abr = abr.replace("-", "");
//        System.out.println(abr); -- найскладніша частина
    }

}
